tap "cartr/qt4"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Java build tool
brew "ant"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext", link: true
# Core application library for C
brew "glib"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Static analysis of C and C++ code
brew "cppcheck"
# Wordlist generator
brew "crunch"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# File comparison utilities
brew "diffutils"
# Standard SGML representation system for technical documents
brew "docbook"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker-compose completion script
brew "docker-compose-completion"
# Docker-machine completion script
brew "docker-machine-completion"
# GNU version of the tar archiving utility
brew "gnu-tar", args: ["with-default-names"]
# General-purpose data compression with high compression ratio
brew "xz"
# Debian package management system
brew "dpkg"
# Classic UNIX line editor
brew "ed"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils", args: ["with-default-names"]
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU debugger
brew "gdb"
# Image manipulation library
brew "jpeg"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# C code prettifier
brew "gnu-indent", args: ["with-default-names"]
# GNU implementation of the famous stream editor
brew "gnu-sed", args: ["with-default-names"]
# GNU implementation of which utility
brew "gnu-which", args: ["with-default-names"]
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python"
# GNU grep, egrep and fgrep
brew "grep", args: ["with-default-names"]
# SMART hard drive monitoring
brew "smartmontools", link: false
# Graphical user interface for smartctl
brew "gsmartcontrol"
# GUI toolkit
brew "gtk+"
# Popular GNU data compression program
brew "gzip"
# Website copier/offline browser
brew "httrack"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Sophisticated file transfer program
brew "lftp"
# Conversion library
brew "libiconv"
# Portable library for network traffic capture
brew "libpcap"
# Library for USB device access
brew "libusb"
# GNOME XML library
brew "libxml2", link: true
# C XSLT library for GNOME
brew "libxslt"
# Next-gen compiler infrastructure
brew "llvm"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# High-performance, schema-free, document-oriented database
brew "mongodb"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# PNG file optimizer
brew "optipng"
# Object-relational database system
brew "postgresql"
# Show ps output as a tree
brew "pstree"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby@2.1"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# HTTP regression testing and benchmarking utility
brew "siege"
# SOund eXchange: universal sound sample translator
brew "sox"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Powerful free data recovery utility
brew "testdisk"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Cross-platform C++ GUI toolkit (wxWidgets for macOS)
brew "wxmac"
# JavaScript package manager
brew "yarn", args: ["without-node"]
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# New zlib (gzip, deflate) compatible compressor
brew "zopfli"
# Python bindings for Qt
brew "cartr/qt4/pyside@1.2"
cask "betterzipql"
cask "docker"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "suspicious-package"
cask "textexpander"
cask "vagrant"
cask "webpquicklook"
